mother("Ефанда 	 ", "Игорь I Старый, вел. кн. Киевский").
father("Рюрик I, кн. Новгородский", "Игорь I Старый, вел. кн. Киевский").
mother("Ефанда 	 ", "Олег Младший, кн. Ладожский").
father("Рюрик I, кн. Новгородский", "Олег Младший, кн. Ладожский").
mother("Ольга Мудрая, кн. Киевская", "Святослав I, вел.кн. Киевский").
father("Игорь I Старый, вел. кн. Киевский", "Святослав I, вел.кн. Киевский").
mother("Предслава Моравская", "Ярополк I Святославич, вел.кн. Киевский").
father("Святослав I, вел.кн. Киевский", "Ярополк I Святославич, вел.кн. Киевский").
mother("Предслава Моравская", "Олег Святославич, кн. Древлянский").
father("Святослав I, вел.кн. Киевский", "Олег Святославич, кн. Древлянский").
mother("Малуша 	 ", "Владимир I Святославич Святой, вел.кн. Киевский").
father("Святослав I, вел.кн. Киевский", "Владимир I Святославич Святой, вел.кн. Киевский").
mother("Ольга Мудрая, кн. Киевская", "Святослав I, вел.кн. Киевский").
father("Володислав ", "Святослав I, вел.кн. Киевский").
mother("Олова 	 ", "Вышеслав Владимирович, кн. Новгородский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Вышеслав Владимирович, кн. Новгородский").
mother("Рогнеда Рогволодовна, кнж. Полоцкая", "Изяслав Владимирович, кн. Полоцкий").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Изяслав Владимирович, кн. Полоцкий").
mother("Рогнеда Рогволодовна, кнж. Полоцкая", "Ярослав I Владимирович Мудрый, вел.кн. Киевский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Ярослав I Владимирович Мудрый, вел.кн. Киевский").
mother("Рогнеда Рогволодовна, кнж. Полоцкая", "Всеволод Владимирович, кн. Владимиро-Волынский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Всеволод Владимирович, кн. Владимиро-Волынский").
mother("Рогнеда Рогволодовна, кнж. Полоцкая", "Предслава Владимировна, кнж. Киевская").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Предслава Владимировна, кнж. Киевская").
mother("Рогнеда Рогволодовна, кнж. Полоцкая", "Премислава Владимировна, кнж. Киевская").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Премислава Владимировна, кнж. Киевская").
mother("Юлия Греческая", "Святополк I Владимирович Окаянный, вел.кн. Киевский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Святополк I Владимирович Окаянный, вел.кн. Киевский").
mother("Малфрида 	 ", "Святослав Владимирович, кн. Древлянский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Святослав Владимирович, кн. Древлянский").
mother("Аделья 	 ", "Мстислав Владимирович Храбрый, кн. Тмутараканский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Мстислав Владимирович Храбрый, кн. Тмутараканский").
mother("Аделья 	 ", "Станислав Владимирович, кн. Смоленский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Станислав Владимирович, кн. Смоленский").
mother("Аделья 	 ", "Судислав Владимирович, кн. Псковский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Судислав Владимирович, кн. Псковский").
mother("Анна Византийская", "Борис Владимирович Святой, кн. Ростовский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Борис Владимирович Святой, кн. Ростовский").
mother("Анна Византийская", "Глеб Владимирович Святой, кн. Муромский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Глеб Владимирович Святой, кн. Муромский").
mother("N Йонингенская", "Позвизд Владимирович, кнж. Киевский").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Позвизд Владимирович, кнж. Киевский").
mother("N Йонингенская", "Мария-Добронега Владимировна, кнж. Киевская").
father("Владимир I Святославич Святой, вел.кн. Киевский", "Мария-Добронега Владимировна, кнж. Киевская").
mother("N Йонингенская", "N, кнж. Киевская").
father("Владимир I Святославич Святой, вел.кн. Киевский", "N, кнж. Киевская").
mother("Анна ", "Илья Ярославич, кн. Новгородский").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Илья Ярославич, кн. Новгородский").
mother("Индигерда (Анна) Шведская", "Владимир Ярославич, кн. Новгородский").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Владимир Ярославич, кн. Новгородский").
mother("Индигерда (Анна) Шведская", "Изяслав I (Дмитрий) Ярославич, вел.кн. Киевский").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Изяслав I (Дмитрий) Ярославич, вел.кн. Киевский").
mother("Индигерда (Анна) Шведская", "Святослав II Ярославич, вел.кн. Киевский").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Святослав II Ярославич, вел.кн. Киевский").
mother("Индигерда (Анна) Шведская", "Анастасия Ярославна, кнж. Киевская").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Анастасия Ярославна, кнж. Киевская").
mother("Индигерда (Анна) Шведская", "Елизавета Ярославна, кнж. Киевская").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Елизавета Ярославна, кнж. Киевская").
mother("Индигерда (Анна) Шведская", "Всеволод I Ярославич, вел.кн. Киевский").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Всеволод I Ярославич, вел.кн. Киевский").
mother("Индигерда (Анна) Шведская", "Анна Ярославна Киевская").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Анна Ярославна Киевская").
mother("Индигерда (Анна) Шведская", "Вячеслав Ярославич, кн. Смоленский").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Вячеслав Ярославич, кн. Смоленский").
mother("Индигерда (Анна) Шведская", "Игорь Ярославич, кн. Владимиро-Волынский").
father("Ярослав I Владимирович Мудрый, вел.кн. Киевский", "Игорь Ярославич, кн. Владимиро-Волынский").
mother("Киликия ", "Глеб Святославич, кн. Новгородский").
father("Святослав II Ярославич, вел.кн. Киевский", "Глеб Святославич, кн. Новгородский").
mother("Киликия ", "Роман Святославич Красный, кн. Тмутараканский").
father("Святослав II Ярославич, вел.кн. Киевский", "Роман Святославич Красный, кн. Тмутараканский").
mother("Киликия ", "Давыд Святославич, кн. Черниговский").
father("Святослав II Ярославич, вел.кн. Киевский", "Давыд Святославич, кн. Черниговский").
mother("Киликия ", "Олег Святославич Гориславич, кн. Черниговский").
father("Святослав II Ярославич, вел.кн. Киевский", "Олег Святославич Гориславич, кн. Черниговский").
mother("Киликия ", "Предслава Святославна, кнж. Киевская").
father("Святослав II Ярославич, вел.кн. Киевский", "Предслава Святославна, кнж. Киевская").
mother("Ода Леопольдовна Австрийская", "Ярослав (Панкратий) Святославич, кн. Муромский").
father("Святослав II Ярославич, вел.кн. Киевский", "Ярослав (Панкратий) Святославич, кн. Муромский").
mother("Феофано Музалон", "Всеволод II Ольгович, вел.кн. Киевский").
father("Олег Святославич Гориславич, кн. Черниговский", "Всеволод II Ольгович, вел.кн. Киевский").
mother("Феофано Музалон", "Игорь II Ольгович, вел.кн. Киевский").
father("Олег Святославич Гориславич, кн. Черниговский", "Игорь II Ольгович, вел.кн. Киевский").
mother("Феофано Музалон", "Глеб Ольгович, кн. Курский").
father("Олег Святославич Гориславич, кн. Черниговский", "Глеб Ольгович, кн. Курский").
mother("Феофано Музалон", "Иван Ольгович, кнж. Черниговский").
father("Олег Святославич Гориславич, кн. Черниговский", "Иван Ольгович, кнж. Черниговский").
mother("N Половецкая", "Святослав Ольгович, кн. Новгород-Северский").
father("Олег Святославич Гориславич, кн. Черниговский", "Святослав Ольгович, кн. Новгород-Северский").
mother("Агафья Мстиславна, кнж. Киевская", "Святослав III Всеволодович, вел.кн. Киевский").
father("Всеволод II Ольгович, вел.кн. Киевский", "Святослав III Всеволодович, вел.кн. Киевский").
mother("Агафья Мстиславна, кнж. Киевская", "Ярослав Всеволодович, кн. Черниговский").
father("Всеволод II Ольгович, вел.кн. Киевский", "Ярослав Всеволодович, кн. Черниговский").
mother("Агафья Мстиславна, кнж. Киевская", "Владимир Всеволодович, кнж. Черниговский").
father("Всеволод II Ольгович, вел.кн. Киевский", "Владимир Всеволодович, кнж. Черниговский").
mother("Агафья Мстиславна, кнж. Киевская", "Звенислава Всеволодовна, кнж. Черниговская").
father("Всеволод II Ольгович, вел.кн. Киевский", "Звенислава Всеволодовна, кнж. Черниговская").
mother("Агафья Мстиславна, кнж. Киевская", "Анна Всеволодовна, кнж. Черниговская").
father("Всеволод II Ольгович, вел.кн. Киевский", "Анна Всеволодовна, кнж. Черниговская").
mother("Мария Васильковна, кнж. Витебская", "Олег Святославич, кн. Черниговский").
father("Святослав III Всеволодович, вел.кн. Киевский", "Олег Святославич, кн. Черниговский").
mother("Мария Васильковна, кнж. Витебская", "Владимир Святославич, кн. Новгородский").
father("Святослав III Всеволодович, вел.кн. Киевский", "Владимир Святославич, кн. Новгородский").
mother("Мария Васильковна, кнж. Витебская", "Всеволод III Святославич Чермный, вел.кн. Киевский").
father("Святослав III Всеволодович, вел.кн. Киевский", "Всеволод III Святославич Чермный, вел.кн. Киевский").
mother("Мария Васильковна, кнж. Витебская", "Болеслава Святославна, кнж. Черниговская").
father("Святослав III Всеволодович, вел.кн. Киевский", "Болеслава Святославна, кнж. Черниговская").
mother("Мария Васильковна, кнж. Витебская", "N Святославна, кнж. Черниговская").
father("Святослав III Всеволодович, вел.кн. Киевский", "N Святославна, кнж. Черниговская").
mother("Мария Васильковна, кнж. Витебская", "Глеб Святославич, кн. Черниговский").
father("Святослав III Всеволодович, вел.кн. Киевский", "Глеб Святославич, кн. Черниговский").
mother("Мария Васильковна, кнж. Витебская", "Мстислав Святославич, кн. Черниговский").
father("Святослав III Всеволодович, вел.кн. Киевский", "Мстислав Святославич, кн. Черниговский").
mother("Мария Васильковна, кнж. Витебская", "N Святославна, кнж. Черниговская").
father("Святослав III Всеволодович, вел.кн. Киевский", "N Святославна, кнж. Черниговская").
mother("Мария Польская", "Михаил II Всеволодович Святой, вел.кн. Киевский").
father("Всеволод III Святославич Чермный, вел.кн. Киевский", "Михаил II Всеволодович Святой, вел.кн. Киевский").
mother("N ", "Андрей Всеволодович, кнж. Черниговский").
father("Всеволод III Святославич Чермный, вел.кн. Киевский", "Андрей Всеволодович, кнж. Черниговский").
mother("N ", "Агафья Всеволодовна, кнж. Черниговская").
father("Всеволод III Святославич Чермный, вел.кн. Киевский", "Агафья Всеволодовна, кнж. Черниговская").
mother("N ", "Вера Всеволодовна, кнж. Черниговская").
father("Всеволод III Святославич Чермный, вел.кн. Киевский", "Вера Всеволодовна, кнж. Черниговская").
mother("Мария Романовна, кнж. Владимиро-Волынская", "Ростислав Михайлович, кн. Черниговский").
father("Михаил II Всеволодович Святой, вел.кн. Киевский", "Ростислав Михайлович, кн. Черниговский").
mother("Мария Романовна, кнж. Владимиро-Волынская", "Феодулия (Ефросинья) Михайловна Святая, кнж. Черниговская").
father("Михаил II Всеволодович Святой, вел.кн. Киевский", "Феодулия (Ефросинья) Михайловна Святая, кнж. Черниговская").
mother("Мария Романовна, кнж. Владимиро-Волынская", "Роман Михайлович Старый, кн. Брянский").
father("Михаил II Всеволодович Святой, вел.кн. Киевский", "Роман Михайлович Старый, кн. Брянский").
mother("Мария Романовна, кнж. Владимиро-Волынская", "Семен Михайлович, кн. Глуховский").
father("Михаил II Всеволодович Святой, вел.кн. Киевский", "Семен Михайлович, кн. Глуховский").
mother("Мария Романовна, кнж. Владимиро-Волынская", "Мстислав Михайлович, кн. Карачевский").
father("Михаил II Всеволодович Святой, вел.кн. Киевский", "Мстислав Михайлович, кн. Карачевский").
mother("Мария Романовна, кнж. Владимиро-Волынская", "Юрий Михайлович, кн. Тарусский").
father("Михаил II Всеволодович Святой, вел.кн. Киевский", "Юрий Михайлович, кн. Тарусский").
mother("Мария Романовна, кнж. Владимиро-Волынская", "Мария Михайловна, кнж. Черниговская").
father("Михаил II Всеволодович Святой, вел.кн. Киевский", "Мария Михайловна, кнж. Черниговская").
father("Семен Михайлович, кн. Глуховский", "Михаил Семенович, кн. Глуховский").
father("Семен Михайлович, кн. Глуховский", "Александр Семенович, кн. Новосильский").
father("Семен Михайлович, кн. Глуховский", "Всеволод Семенович, кн. Устивльский").
father("Михаил Семенович, кн. Глуховский", "Семен Михайлович, кн. Глуховский").
father("Михаил Семенович, кн. Глуховский", "Юрий Михайлович, кн. Тарусский").
father("Семен Михайлович, кн. Глуховский", "Роман Семенович, кн. Новосильский").
father("Роман Семенович, кн. Новосильский", "Василий Романович, кн. Белевский").
father("Роман Семенович, кн. Новосильский", "Лев Романович, кн. Одоевский").
father("Роман Семенович, кн. Новосильский", "Семен Романович, кн. Новосильский").
father("Роман Семенович, кн. Новосильский", "Даниил Романович, кн. Новосильский").
father("Роман Семенович, кн. Новосильский", "Юрий Романович Черный, кн. Одоевский").
father("Мстислав Михайлович, кн. Карачевский", "Святослав Мстиславич, кн. Карачевский").
father("Мстислав Михайлович, кн. Карачевский", "Пантелеймон Мстиславич, кн. Карачевский").
father("Мстислав Михайлович, кн. Карачевский", "Тит Мстиславич, кн. Карачевский").
father("Мстислав Михайлович, кн. Карачевский", "Андрей (Андриан) Мстиславич, кн. Звенигородский").
father("Тит Мстиславич, кн. Карачевский", "Святослав Титович, кн. Карачевский").
father("Тит Мстиславич, кн. Карачевский", "Василий Титович, кн. Козельский").
father("Тит Мстиславич, кн. Карачевский", "Федор Титович, кн. Козельский").
father("Тит Мстиславич, кн. Карачевский", "Иван Титович, кн. Козельский").
father("Тит Мстиславич, кн. Карачевский", "Андриан Титович, кн. Звенигородский").
mother("Феодора Ольгердовна, кн. Литовская", "Федор Святославич, кн. Карачевский").
father("Святослав Титович, кн. Карачевский", "Федор Святославич, кн. Карачевский").
mother("Феодора Ольгердовна, кн. Литовская", "Василий Святославич, кн. Карачевский").
father("Святослав Титович, кн. Карачевский", "Василий Святославич, кн. Карачевский").
mother("Феодора Ольгердовна, кн. Литовская", "Юрий Святославич, кн. Мосальский").
father("Святослав Титович, кн. Карачевский", "Юрий Святославич, кн. Мосальский").
mother("Феодора Ольгердовна, кн. Литовская", "Мстислав Святославич, кн. Карачевский").
father("Святослав Титович, кн. Карачевский", "Мстислав Святославич, кн. Карачевский").
mother("Феодора Ольгердовна, кн. Литовская", "Святослав Святославич, кн. Карачевский").
father("Святослав Титович, кн. Карачевский", "Святослав Святославич, кн. Карачевский").
father("Юрий Святославич, кн. Мосальский", "Владимир Юрьевич Мосальский").
father("Юрий Святославич, кн. Мосальский", "Василий Юрьевич Мосальский").
father("Юрий Святославич, кн. Мосальский", "Семен Юрьевич Мосальский").
father("Федор Титович, кн. Козельский", "Тит-Юрий Федорович, кн. Козельский").
father("Федор Титович, кн. Козельский", "Иван Федорович Шонур, кн. Козельский").
father("Тит-Юрий Федорович, кн. Козельский", "Григорий Титович Огонь, кн. Козельский").
father("Тит-Юрий Федорович, кн. Козельский", "Владимир Титович Пузырь, кн. Козельский").
mother("Агриппина Ольговна, кнж. Рязанская", "Роман Иванович Горчак, кн. Козельский").
father("Иван Титович, кн. Козельский", "Роман Иванович Горчак, кн. Козельский").
mother("Агриппина Ольговна, кнж. Рязанская", "Федор Иванович, кн. Елецкий").
father("Иван Титович, кн. Козельский", "Федор Иванович, кн. Елецкий").
father("Роман Иванович Горчак, кн. Козельский", "Андрей Романович Горчаков").
father("Роман Иванович Горчак, кн. Козельский", "Григорий Романович Горчаков").
father("Федор Иванович, кн. Елецкий", "Иван Федорович Елецкий").
father("Федор, князь Звенигородский", "Александр Федорович Звенигородский").
father("Иван Андреевич Болх, кн. Звенигородский", "Иван Иванович Адаш Болховский").
mother("Елена Гимонтовна, кнж. Литовская", "Федор Андреевич, кн. Звенигородский").
father("Андрей (Андриан) Мстиславич, кн. Звенигородский", "Федор Андреевич, кн. Звенигородский").
mother("Елена Гимонтовна, кнж. Литовская", "Иван Андреевич Болх, кн. Звенигородский").
father("Андрей (Андриан) Мстиславич, кн. Звенигородский", "Иван Андреевич Болх, кн. Звенигородский").
father("Андриан Титович, кн. Звенигородский", "Федор Андреевич, кн. Звенигородский").
father("Андриан Титович, кн. Звенигородский", "Иван Андреевич Болх, кн. Звенигородский").
father("Юрий Михайлович, кн. Тарусский", "Всеволод Юрьевич Орехва Тарусский").
father("Юрий Михайлович, кн. Тарусский", "Семен Юрьевич, кн. Конинский").
father("Юрий Михайлович, кн. Тарусский", "Михаил Юрьевич Мышецкий").
father("Юрий Михайлович, кн. Тарусский", "Иван Юрьевич Толстая Голова, кн. Волконский").
father("Юрий Михайлович, кн. Тарусский", "Константин Юрьевич, кн. Оболенский").
father("Иван Юрьевич Толстая Голова, кн. Волконский", "Федор Иванович Волконский").
father("Всеволод Юрьевич Орехва Тарусский", "Андрей Всеволодович Шутиха Мезецкий").
father("Всеволод Юрьевич Орехва Тарусский", "Дмитрий Всеволодович Мезецкий").
father("Федор Андреевич Мезецкий", "Михаил Федорович Мезецкий").
father("Федор Андреевич Мезецкий", "Федор Федорович Сухой Мезецкий").
father("Федор Андреевич Мезецкий", "Петр Федорович Мезецкий").
father("Федор Андреевич Мезецкий", "Василий Федорович Кукубяка Мезецкий").
father("Федор Андреевич Мезецкий", "Иван Федорович Говдыревский").
mother("Евпраксия ", "Александр Андреевич Барятинский").
father("Андрей Всеволодович Шутиха Мезецкий", "Александр Андреевич Барятинский").
mother("Евпраксия ", "Федор Андреевич Мезецкий").
father("Андрей Всеволодович Шутиха Мезецкий", "Федор Андреевич Мезецкий").
mother("Евпраксия ", "Роман Андреевич Мезецкий").
father("Андрей Всеволодович Шутиха Мезецкий", "Роман Андреевич Мезецкий").
mother("Евпраксия ", "Иван Андреевич Мезецкий").
father("Андрей Всеволодович Шутиха Мезецкий", "Иван Андреевич Мезецкий").
mother("Евпраксия ", "Василий Андреевич Слепой Мезецкий").
father("Андрей Всеволодович Шутиха Мезецкий", "Василий Андреевич Слепой Мезецкий").
mother("Евпраксия ", "Марфа Михайловна Мезецкая").
father("Андрей Всеволодович Шутиха Мезецкий", "Марфа Михайловна Мезецкая").
mother("Евпраксия ", "Аксинья (Ксения) Михайловна Мезецкая").
father("Андрей Всеволодович Шутиха Мезецкий", "Аксинья (Ксения) Михайловна Мезецкая").
mother("Евпраксия ", "Евдокия (Авдотья) Андреевна Мезецкая").
father("Андрей Всеволодович Шутиха Мезецкий", "Евдокия (Авдотья) Андреевна Мезецкая").
father("Александр Андреевич Барятинский", "Григорий Александрович Барятинский").
father("Александр Андреевич Барятинский", "Дмитрий Александрович Барятинский").
father("Александр Андреевич Барятинский", "Федор Александрович Барятинский").
father("Александр Андреевич Барятинский", "Лев Александрович Барятинский").
father("Семен Юрьевич, кн. Конинский", "Дмитрий, кн. Конинский").
father("Федор Федорович Сухой Мезецкий", "Иван Федорович Мезецкий").
father("Константин Юрьевич, кн. Оболенский", "Семен Константинович, кн. Оболенский").
father("Константин Юрьевич, кн. Оболенский", "Иван Константинович, кн. Оболенский").
father("Константин Юрьевич, кн. Оболенский", "Андрей Константинович, кн. Оболенский").
father("Иван Константинович, кн. Оболенский", "Никита Иванович, кн. Оболенский").
father("Иван Константинович, кн. Оболенский", "Василий Иванович Косой, кн. Оболенский").
father("Иван Константинович, кн. Оболенский", "Михаил Иванович, кн. Оболенский").
father("Иван Константинович, кн. Оболенский", "Семен Иванович, кн. Оболенский").
father("Иван Константинович, кн. Оболенский", "Владимир Иванович, кн. Оболенский").
father("Иван Константинович, кн. Оболенский", "Глеб Иванович, кн. Оболенский").
father("Михаил Иванович, кн. Оболенский", "Андрей Михайлович Дурной, кн. Оболенский").
father("Михаил Иванович, кн. Оболенский", "Борис Михайлович Туреня, кн. Оболенский").
father("Михаил Иванович, кн. Оболенский", "Иоасаф Михайлович, кн. Оболенский").
father("Михаил Иванович, кн. Оболенский", "Иван Михайлович Репня, кн. Оболенский").
father("Михаил Иванович, кн. Оболенский", "Андрей Михайлович Пенинский, кн. Оболенский").
father("Иван Михайлович Репня, кн. Оболенский", "Василий (Вассиан) Иванович Большой Репнин-Оболенский").
father("Иван Михайлович Репня, кн. Оболенский", "Петр Иванович Репнин-Оболенский").
father("Иван Михайлович Репня, кн. Оболенский", "Василий Иванович Меньшой Репнин-Оболенский").
father("Константин Семенович, кн. Оболенский", "Василий Константинович Краса Оболенский").
father("Константин Семенович, кн. Оболенский", "Иван Константинович Глупой Оболенский").
father("Константин Семенович, кн. Оболенский", "Василий Константинович Горенский Оболенский").
father("Константин Семенович, кн. Оболенский", "Михаил Константинович Сухорукий Оболенский").
father("Константин Семенович, кн. Оболенский", "Юрий Константинович Глазатый Оболенский").
father("Константин Семенович, кн. Оболенский", "Борис Константинович Оболенский").
father("Константин Семенович, кн. Оболенский", "Дмитрий Константинович Оболенский").
father("Константин Семенович, кн. Оболенский", "Петр Константинович Оболенский").
father("Константин Семенович, кн. Оболенский", "Дмитрий Константинович Королек Оболенский").
father("Константин Семенович, кн. Оболенский", "Василий Константинович Белый Оболенский").
father("Константин Семенович, кн. Оболенский", "Иван Константинович Оболенский").
father("Семен Иванович, кн. Оболенский", "Константин Семенович, кн. Оболенский").
father("Семен Иванович, кн. Оболенский", "Дмитрий Семенович Щепа, кн. Оболенский").
father("Михаил Константинович Сухорукий Оболенский", "Федор Михайлович ЧерныйОболенский").
father("Михаил Константинович Сухорукий Оболенский", "Андрей Михайлович Оболенский").
father("Михаил Константинович Сухорукий Оболенский", "Василий Михайлович Оболенский").
father("Борис Константинович Оболенский", "Василий Борисович Тюфяка Оболенский").
father("Борис Константинович Оболенский", "Иван Борисович Оболенский").
father("Василий Борисович Тюфяка Оболенский", "Михаил Васильевич Тюфякин").
father("Василий Борисович Тюфяка Оболенский", "Василий Васильевич Тюфякин").
father("Василий Борисович Тюфяка Оболенский", "Федор Васильевич Тюфякин").
father("Василий Борисович Тюфяка Оболенский", "Семен Васильевич Тюфякин").
father("Василий Борисович Тюфяка Оболенский", "Никита Васильевич Тюфякин").
father("Андрей Константинович, кн. Оболенский", "Иван Андреевич Долгорукий, кн. Оболенский").
father("Андрей Константинович, кн. Оболенский", "Василий Андреевич Щербатый, кн. Оболенский").
father("Андрей Константинович, кн. Оболенский", "Александр Андреевич Тростенский, кн. Оболенский").
father("Иван Андреевич Долгорукий, кн. Оболенский", "Владимир Андреевич Долгоруков").
father("Василий Андреевич Щербатый, кн. Оболенский", "Василий Васильевич Щербатов").
mother("Ирина (Мария) Мономах", "Владимир II Всеволодович Мономах, вел.кн Киевский").
father("Всеволод I Ярославич, вел.кн. Киевский", "Владимир II Всеволодович Мономах, вел.кн Киевский").
mother("Ирина (Мария) Мономах", "Анна (Янка) Всеволодовна, кнж. Киевская").
father("Всеволод I Ярославич, вел.кн. Киевский", "Анна (Янка) Всеволодовна, кнж. Киевская").
mother("Анна, кнж. Половецкая", "Ростислав Всеволодович, кн. Переяславский").
father("Всеволод I Ярославич, вел.кн. Киевский", "Ростислав Всеволодович, кн. Переяславский").
mother("Анна, кнж. Половецкая", "Евпраксия (Адельгейда) Всеволодовна, кнж. Киевская").